Tutorial3/Scale5/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
      vessel
    {
        type triSurfaceMesh;
        file "vessel.stl";
    }
 inlet
    {
        type triSurfaceMesh;
        file "inlet.stl";
    }
 outlet
    {
        type triSurfaceMesh;
        file "outlet.stl";
    }


 /*
 cylinlet
    {
     type searchableCylinder;
        point1 (500.01 0.1 500.01);
        point2 500.01 250.1 500.01);
        radius 50;
    }
 cyloutlet
    {
        type searchableCylinder;
        point1 (500.01 1260.01 1197.01);
        point2 (500.01 1260.01 1250.01);
        radius 50;
    }
*/

    //- Used to define MRF zone and refine mesh round the impeller 
   
}


castellatedMeshControls
{

    maxLocalCells 1000000;

    maxGlobalCells 20000000;

    minRefinementCells 0;

    nCellsBetweenLevels 3;

    maxLoadUnbalance 0.10;

    features
    (
        {
            file "vessel.eMesh";
            level 1;
        }
{
            file "inlet.eMesh";
            level 2;
        }
 {
            file "outlet.eMesh";
            level 2;
        }


	     
    );

    resolveFeatureAngle 30;

    refinementSurfaces
    {
       

        vessel
        {
            level (1 1);
	        }
	inlet
        {
                level (2 2);
                }

	outlet
	{
            level (2 2);
	        }

	/*cylinlet
	{
             level (1 1);
             cellZoneInside inside;
       	     }

	cyloutlet
	{
             level (1 1);
             cellZoneInside inside;
       	     }
*/
    }

    refinementRegions
    {
  /* cylinlet
	{
	mode inside;
	level (1 1);
	}

	cyloutlet
	 {
            mode inside;
            levels ((2 2));
        }*/
/*      
        inlet
	{
	mode inside;
	level (2 2);
	}

	outlet
	 {
            mode inside;
            levels ((2 2));
        }
*/
    }

    locationInMesh (520.01 500.01 550.01); // Inside point

    allowFreeStandingZoneFaces true;
}

// Settings for the snapping.
snapControls
{

    nSmoothPatch 3;

    tolerance 1.0;

    nSolveIter 300;

    nRelaxIter 10;

    nFeatureSnapIter 10;

    implicitFeatureSnap true;

    explicitFeatureSnap false;

    multiRegionFeatureSnap true;
}

// Settings for the layer addition.
addLayersControls
{

    relativeSizes true;

    layers
    {
    }

    expansionRatio 1.0;

    finalLayerThickness 0.3;

    minThickness 0.25;

    nGrow 0;

    featureAngle 30;

    nRelaxIter 5;

    nSmoothSurfaceNormals 1;

    nSmoothNormals 3;

    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;

    maxThicknessToMedialRatio 0.3;

    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;

    nLayerIter 50;

    nRelaxedIter 20;
}

meshQualityControls
{
    #include "meshQualityDict"

    relaxed
    {
        maxNonOrtho 75;
    }
}

writeFlags
(
);

mergeTolerance 1E-6;


// ************************************************************************* //
